In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create Data
stuff = {
    'Corporation': ['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    'Employees': ['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary': [200, 220, 190, 130, 120, 150]
}

In [3]:
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [8]:
# Group By Corporation
company = my_df.groupby('Corporation')
company

In [16]:
company.sum(numeric_only=True)

             Salary
Corporation
Apple           330
Google          340
Meta            340

In [17]:
# Mean
company.mean(numeric_only=True)

             Salary
Corporation
Apple         165.0
Google        170.0
Meta          170.0

In [19]:
# Max
company.max(numeric_only=True)

             Salary
Corporation
Apple           200
Google          220
Meta            190

In [22]:
# Min
company.min(numeric_only=True)

             Salary
Corporation
Apple           130
Google          120
Meta            150

In [27]:
# Standard Deviation
company.std(numeric_only=True)

                Salary
Corporation
Apple        49.497475
Google       70.710678
Meta         28.284271

In [28]:
# Variance
company.var(numeric_only=True)

             Salary
Corporation
Apple        2450.0
Google       5000.0
Meta          800.0

In [33]:
# Describe
company.describe()

            Salary
             count   mean        std    min    25%    50%    75%    max
Corporation
Apple          2.0  165.0  49.497475  130.0  147.5  165.0  182.5  200.0
Google         2.0  170.0  70.710678  120.0  145.0  170.0  195.0  220.0
Meta           2.0  170.0  28.284271  150.0  160.0  170.0  180.0  190.0